---
kind: method
id: M:Autodesk.Revit.DB.ForgeTypeId.Dispose
source: html/daba102f-ed84-269e-5aba-cddad3588e88.htm
---
# Autodesk.Revit.DB.ForgeTypeId.Dispose Method

Releases all resources used by the ForgeTypeId

## Syntax (C#)
```csharp
public void Dispose()
```